flix/app/controllers/favorites_controller.rb

	def create
		@movie.favorites.create!(user: current_user)
---
INSERT INTO "favorites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-12-21 00:18:08.744985"], ["movie_id", 1], ["updated_at", "2015-12-21 00:18:08.744985"], ["user_id", 1]]