flix/app/controllers/genres_controller.rb

INSERT INTO "genres" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-12-23 22:11:57.678130"], ["name", "Gibberish"], ["updated_at", "2015-12-23 22:11:57.678130"]]
---
	def create
		@genre = Genre.new(genre_params)
		if @genre.save