flix/app/controllers/movies_controller.rb

  def show
    @movie = Movie.find(params[:id])
    @fans = @movie.fans
    if current_user
      @current_favorite = current_user.favorites.find_by(movie: @movie.id)
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = 1 LIMIT 1  [["user_id", 1]]