flix/app/controllers/movies_controller.rb

SELECT "genres".* FROM "genres"
---
  def index
    case params[:scope]
    when "hits"
      @movies = Movie.hits
    when "flops"
      @movies = Movie.flops
    when "upcoming"
      @movies = Movie.upcoming
    when "recent"
      @movies = Movie.recent(4)
    else
      @movies = Movie.released
    end
    @genres = Genre.all

SELECT  "movies".* FROM "movies"  WHERE "movies"."slug" = 'batman-vs-godzilla' LIMIT 1
---
  def set_movie
    @movie = Movie.find_by!(slug: params[:id])