flix/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ?, "username" = ? WHERE "users"."id" = 1  [["email", "taylorkcrane@gmail.com"], ["updated_at", "2015-11-30 22:15:02.495463"], ["username", "taykcrane"]]
---
	def update
		@user = User.find(params[:id])
		if @user.update(user_params)