flix/app/controllers/users_controller.rb

	def show
		@user = User.find_by!(username: params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."username" = 'dan' LIMIT 1