flix/app/views/movies/_form.html.erb

      </li>
      <li><%= f.collection_check_boxes(:genre_ids, Genre.all, :id, :name) %></li>
---
SELECT "genres".* FROM "genres"