flix/app/views/movies/show.html.erb

SELECT COUNT(*) FROM "favorites"  WHERE "favorites"."movie_id" = ?  [["movie_id", 1]]
---

  <h3><%= pluralize(@movie.favorites.size, "favorite") %></h3>